const info = `Имя философа;Годы жизни;Главное сочинение
1;2;3
Философи древнего востока;;
Древнекитайская философия;;
Лао-цзы (Ли Эр);579 - 499 гг. до н.э.;"""Дао-дэ-цзин"" (""путь добродетели"")"
Кун-Фу-цзы (Конфуцйи);551 - 479 гг до нэ;"""Шицзин"" (книга песен) ""луньюй"" (""Беседы и суждения"")"
Мо-цзы;ок 479 - ок 400 до нэ;"""Мо-цзы"""
Чжуан-чжоу;369-283 гг до нэ;"""Чжуаг-цзы"""
Древнеиндийская философия;;
Сиддхарта Гаутама Шакьямуни (Будда);VI в до нэ;"учение изложено в каноне ""трипитака"" (типитака)"
Вардхамана Махавира (Джина);VI в до нэ;"""Триратна"" (""Три жемчужины"")"
Нагарджуна;I - II в нэ;"""Мадхьямика-сутра"""
Античная философия;;
Древняя греция;;
Млетская школа;;
Фалес;625 - 547 гг до нэ;"""О солнцевороте"", ""о равноденствии"""
Анаксимандр;610 - 550 гг до нэ;"""О природе"", ""о неподвижных звездах"""
Анаксимен;585- 525 гг до нэ;сведений нет
Элейская школа;;
Ксенофан;565 - 473 гг до нэ;"""О природе"" (поэма)"
Парменид;540 - 470 гг до нэ;"""О природе"" (поэма)"
Зенон;490 - 430 гг до нэ;"""О природе"", ""споры"""
Пифагор;580 - 500 гг до нэ;Учение изложено в золотых стихах
Анаксагор;500 - 428 гг до нэ;"""о природе"""
эмпедокл;490-430 до нэ;очищение
гераклит;535 - 475 до нэ;о природе
Школа софистов;;
Георгий;483-375гг до нэ;"""О природе или о несуществующем"""
Протагор;480-410 гг до нэ;"""О богах"", ""наука спора"""
Сократ;469-399 гг до нэ;не писал сочинений
Демокрит;470-370 гг до нэ;"""большой мирострой"", ""малый мирострой"""
Платон;427-347 гг до нэ;"""федон"", ""федр"", ""пир"", ""тимей"", ""госудраство"""
Аристотель;384-322 гг до нэ;"""метафизика"", ""физика"", ""органон"", ""политика"""
Школа киников;;
Пиррон;360-270 гг до нэ;не писал сочинений
Школа стоиков;;
Зенон Китионский;336-264 гг до нэ;сохранились лишь отдельнеые фрагменты
Клеанф;331-230 гг до нэ;"""гимн к зевсу"""
хрисипп;280-208 гг до нэ;сохранились лишь отдельнеые фрагменты
Римская империя;;
Марк Туллий Цицерон;106-43 гг до нэ;58 судебных и политических речей, тракты по риторике, философии политике, письма
Тит Лукреций Кар;99 - 55 гг до нэ;"""О природде вещей"" (поэма)"
Филон Александрийский;25-50 гг до нэ;Комментарии на священные книги
Луций Сенека;4 - 65 гг до нэ;"""навственные письмо к Луцилию"""
Плутарх;45 - 127 гг;"""моралии"", ""сравнительные жизнеописания"""
Эпиктет;50-135 гг;"""беседы"""
Марк Аврелий;121 - 180 гг;"""наедине с собой"""
Секст Эмпирик;200-250;"""пирроновы основоположения"""
Неоплатонизм;;
Плотин;204 - 269 гг;"""Эннсады"""
Порфирий;232-306 гг;"""введение в категории Аристотеля"""
Ямвлих;280-330 гг;"""о египетских мистериях"", ""о пифагорейской жизни"""
Прокл;412 - 485 гг;"""первоосновы теологии"", ""теология платона"""
философия средних веков;;
Раннехристианска фиилософия (патристика);;
Тертуллиан;160-230;"""Апологетика"""
Климент Александрийский;150-215;"""Строматы"", ""педагог"""
Ориген;185-254;"""о началах"", ""против цельса"""
Василий Великий;329-379;"""шестоднев"""
Григорий Богослов;330-390;"""О моей жизни"", ""о моей судьбе"""
Григорий Нисский;335-394;"""большое согогластиельное слово"""
Аврелий Августиг;354-430;"""исповедь"", ""о граде Божьем"""
Северин Боэций;480-524;"""Утешение философией"""
Дионисий Ареопагит;1 век н.э;"""О небесной иерархии"", ""о церковной иерархии"", ""о божественных именах"", ""таинственное богословие"""
Иоанн Адмаскин;675-749;"""источник знаний"""
европейская схластика и философия востока;;
Иоанн Скот Эриугена;810-877;"""О разделении природы"""
Аль-Фараби;870-950;Геммы предмурости
Ибн Сина (Авиценна);980-1037;Книга исцеления
ансельм кентерберийский;1033-1109;Монологион
Иоанн росцеллин;1050-1120;Письмо к Абеляру
Аль-газали;1059-1111;Возрождение наук о вере
Пьер Абеляр;1079-1142;"""да и нет"", ""история бедсткий"""
Бернар Клервоский;1091-1153;"""о любьви к Богу"", ""о благодати"""
Ибн Рущд (Аверроэс);1126-1198;опровержение опровержения
Моисей бенмаймон (маймонид);1135-1204;путеводитель колеблющихся
Альберт Великий;1193-1280;комментарий к Евангелиям
Роджер Бэкон;1214-1292;Руководство изучения богословия
Бонавентура;1221-1274;путеводитель души к Богу
Фома Аквинский;1225-1274;Сумма теологии
Ионан Дунс Скот;1266-1308;Великий комментарий к сентенциям Петра Ломбардского
Уильям Оккам;1290-1350;Трактаты о номинализме
Григорий Палама;1296-1359;Девять слов против Варлаама
философия возрождения и реформации;;
Николай Кузанский;1401-1464;"""О сокрытом Боге"", ""О предпосылках"""
Эразм Роттердамский;1469-1536;"""Похвала глупости"", ""рассуждение о свободе воли"""
Пико делла Мирандола;1463-1494;"""речь о достоинстве человека"""
Никколо Макиавелли;1496-1527;"""государь"", ""история флоренции"""
Томас Мор;1478-1535;утопия
мартин Лютер;1483-1546;"""95 тезисов"", перевод библии на немецкий язык, ""о рабстве воли"""
Ульрих Цвингли;1484-1531;Об истинной и ложной рлигии
Жан Кальвин;1509-1564;Наставление в христианской вере
Мишель де монтень;1533-1592;Опыты
Джордано Бруно;1548-1600;"""О причине, начале и едином"", ""О бесконечности, Вселенной и мирах"""
Томмазо Кампанелла;1568-1639;"""Метафизика"", ""Город Солнца"""
Философия раннего нового времени и эпохи просвящения;;
Фрэнсис Бэкон;1561-1626;"""Новый органон"", ""Новая Атлантида"""
Якоб Беме;1575-1624;"""Аврора, или Утренняя заря в восхождении"""
Томас Гоббс;1588-1679;"""Человеческая природа"", ""Левиафан"""
Пьер Гассенди;1592-1655;Свод философии
Рене Декарт;1596-1650;"""размышление о первой философии"", ""начала философии"""
Блез Паскаль;1623-1662;мысли
Бенедикт Спиноза;1632-1677;"""богословско-политический трактат"", ""этика"""
Джон Локк;1632-1704;"""опыт о человеческом разуме"""
Никола Мальбранш;1638-1715;разыскания истины
Готфрид Лейбниц;1646-1716;"""монадология"", ""теодицея"""
Энтони Шефтсбери;1671-1731;"""моралисты"", ""филосовский образ жизни"""
Джордж Беркли;1684-1753;трактат о началах человеческого знания
Шарль Луи Монтескье;1689-1755;"""о духе законов"", ""персидские письма"""
Вольтер;1694-1778;"""филосовские письма"", ""филосовский словарь"""
Бенджамин Франклин;1706-1790;рассуждение о свободе и необходимости, наслаждении и настрадании
Жюльен Офре де ламетри;1709-1751;Человек-машина
Дэвид Юм;1711-1776;Трактат о человеческой природе
Жан Жак Руссо;1712-1778;"""рассуждение о начале и основаниях неравенства"", ""об общественном договоре"""
Дени Дидро;1713-1784;"""мысли об объяснении природы"", ""Философские принципы материи и движения"""
Клод Адриан Гельвеций;1715-1771;"""об уме"", ""о человеке"""
Этьен Бонно де Кондииньяк;1715-1780;Трактат об ощущениях
Поль Анри Гольбах;1723-1789;Система природы
Иоганн Готфрид Гердер;1744-1803;Идеи к философии истории человечества
Иоган Вольфганг Гете;1749-1832;"""опыт о метаморфозе растений"", ""Учение о цвете"""
Фридрих Шиллер;1759-1805;Письма об эстетическом воспитании
Неметская классиеская философия;;
Иммануил Кант;1724-1804;"""Критика чистого разума"", ""Критика практического разума"", ""Критика способности суждения"""
Иоганн Готлиб Фихте;1762-1814;Наукоучение
Георг Фильгельм Фридрих Гегель;1770-1831;"""Феноменология духа"", ""Наука логики"""
Фридрих Шеллинг;1775-1854;Система трансценлентального идеализма
Людвиг Фейербах;1804-1872;"""Сущность христианства"", ""основы философии будущено"""
Западная философия XIX - XX вв.;;
Артур Щопенгауэр;1788-1860;Мир как воля и представление
Огюст Конт;1798-1857;"""курс позитивной философии"", ""система позитивной пилитики"""
Джон Стюарт Милль;1806-1874;Система логики
Серен Кьеркегор;1813-1855;"""Страх и трепет"", ""Филофские крохи"""
Карл Маркс;1818-1883;"""к критике политичекой экономики"", ""каптиал"""
Фридрих Энгельс;1820-1895;"""анти-дюринг"", ""диалектика природы"""
Герберт Спенсер;1820-1903;"""система синтетической философии"""
Эрнест Мах;1838-1916;"""анализ ощущений"""
Рихард Авенариус;1843-1896;"""человеческой понятие о мире"""
Фридрих Ницше;1844-1900;"""Так говорил Заратустра"", ""По ту сторону добра и зла"", ""Антихристианин"""
Зигмунд Фрейд;1856-1939;"""толкование сновидений"", ""тотем и табу"""
Георг Зиммель;1858-1918;"""Кант и Гете"", ""Взгляд на жизнь"""
Элмунд Гуссерль;1859-1938;Логические исследования
Анри Бергсон;1859-1941;"""творческая эволюция"", ""Материя и память"""
Макс Вебер;1864-1920;"""протестанская этика и дух капитализма"""
Бертан Рассел;1872-1970;"""Религия и наука"","" История западной философии"""
Макс Шелер;1874-1928;"""формы знания и общество"""
Карл Густав Юнг;1875-1961;"""метаморфозы и символы либидо"", ""психологические типы"""
Освальд Шпенглер;1880-1936;"""Закат Европы"""
Пьер Тейяр де Шарден;1881-1955;"""Феномен человека"", ""Божественная среда"""
Сартин Бубер;1882-1965;"""проблема человека"", ""Два образа веры"""
Хосе Ортега-и-Нассет;1883-1955;"""Восстание масс"", ""Дегуманизация исскуства"""
Карл Ясперс;1883-1969;"""Смысл и название истории"", ""Философская вера"""
Людвиг Витгенштейн;1889-1951;Логико-философский трактат
Мартин Хайдеггер;1889-1976;Бытие и время
Эрих Фромм;1900-1980;"""бегство от свободы"", ""Революция надежды"""
Ханс Георг Гадамер;1900-;Истина и метод
Жан Поль Сартр;1905-1980;"""бытие и ничто"", ""Экстенциализм и гуманизм"""
Альбер Камю;1913-1960;"""Миф о Сизифе"", ""Бунтующей человек"""
Русская философия;;
Симеон Полоцкий;1629-1680;"""Жезл Правления"", ""обед душевный"""
Михаил Ломоносов;1711-1765;Петр Великий
Петр Чаадаев;1794-1856;Философические письма
Алексей Хомяков;1804-1860;Церковь - одна
Иван Киреевский;1806-1856;О необходимости и возможности новых начал в философии
Николай Данилевский;1822-1885;Россия и Европа
Николай Федоров;1828-1903;Философия Общего дела
Константин Леонтьев;1831-1891;Византизм и славянство
Владимир Соловьев;1853-1900;"""Россия и вселенская церковь"", ""смысл любьви"", ""оправдание добра"""
Василий Розанов;1856-1919;"""Опавшие листья"", ""Уединенное"""
Владимир Вернадский;1863-1945;"""научная мысль как платеное явление"""
Лев Шестов;1866-1938;"""Афины и Иерусалим"", ""Власть ключей"""
Владимир Ленин;1870-1924;"""Материализм и эмпириокритицизм"", ""Философские тетради"""
Николай Лосский;1870-1965;Обоснование интуитивизма
Сергей Булгаков;1871-1944;Свет Невечерний
Николай Бердяев;1874-1948;"""философия свободы"", ""Смысл творчества"", ""Русская идея"""
Семен Франк;1877-1950;Духовные основы
Павел Флоренский;1882-1943;Столп и утверждени истины
Лев Карсавин;1882-1952;"""Философия истории"", ""о личности"""
Ивал Ильин;1883-1954;"""о монархии и республике"", ""О сопростивлении злу силою"""
Александр Лосев;1893-1988;"""Диалектика мифа"", ""философия имени"", ""история античной эстетики"""`